pub const OS_NAME_ARG_NOT_ZERO = "ওএস -এর নাম() কাজটি কোনো চলরাশি গ্রহণ করে কিন্তু {d}টি দেওয়া হয়েছে";
pub const OS_ARCH_ARG_NOT_ZERO = "ওএস -এর আর্চ() কাজটি কোনো চলরাশি গ্রহণ করে কিন্তু {d}টি দেওয়া হয়েছে";
pub const OS_USERNAME_ARG_NOT_ZERO = "ওএস -এর ব্যবহারকারী() কাজটি কোনো চলরাশি গ্রহণ করে কিন্তু {d}টি দেওয়া হয়েছে";
pub const OS_HOMEDIR_ARG_NOT_ZERO = "ওএস -এর ঘর() কাজটি কোনো চলরাশি গ্রহণ করে কিন্তু {d}টি দেওয়া হয়েছে";
pub const OS_CURDIR_ARG_NOT_ZERO = "ওএস -এর বর্তমান() কাজটি কোনো চলরাশি গ্রহণ করে কিন্তু {d}টি দেওয়া হয়েছে";
