pub const STR_STRING_ACCEPTS_SINGLE_ARG = "স্ট্রিং(...) কাজটি মাত্র একটি চলরাশি গ্রহণ করে কিন্তু {d}টি দেওয়া হয়েছে";
pub const STR_SPLIT_ACCEPTS_TWO_ARGS = "ভাগ(...) কাজটি মাত্র দুটি চলরাশি গ্রহণ করে কিন্তু {d}টি দেওয়া হয়েছে";
pub const STR_SPLIT_NOT_STRING_ARGS = "ভাগ(...) কাজটিতে দেওয়া দুটি চলরাশিকেই স্ট্রিং হতে হবে কিন্তু পাওয়া গেল - {s}({s}) এবং {s}({s})";

pub const STR_SPLIT_INT_CONVERT_A_ERROR = "অভ্যন্তরীণ গোলযোগ; স্ট্রিং ভাগ(...) কাজে গোলযোগ দেখানোর সময় প্রথম রাশিকে স্ট্রিং-এ পরিবর্তন করা সম্ভব হয়নি।";
pub const STR_SPLIT_INT_CONVERT_B_ERROR = "অভ্যন্তরীণ গোলযোগ; স্ট্রিং ভাগ কাজে গোলযোগ দেখানোর সময় দ্বিতীয় রাশিকে স্ট্রিং-এ পরিবর্তন করা সম্ভব হয়নি।";
