/*
 * Copyright (c) 2022 Palash Bauri
 *
 * This Source Code Form is subject to the terms of the Mozilla Public
 * License, v. 2.0. If a copy of the MPL was not distributed with this
 * file, You can obtain one at https://mozilla.org/MPL/2.0/.
 */

#ifndef PANKTI_DIAGON_H
#define PANKTI_DIAGON_H

#ifdef __cplusplus
extern "C" {
#endif

#include <stdbool.h>

#define NO_ERR_CTX_ERR "প্রয়োজনীয় প্রস্তুতি ছাড়াই পঙক্তি চালু হয়েছে"

typedef enum PanDiagCat{
	PAN_DIAG_LEXER = 0,
	PAN_DIAG_PARSER = 1,
	PAN_DIAG_COMPILER = 2,
	PAN_DIAG_RUNTIME = 3,
	PAN_DIAG_STRESCAPE = 4,
}PanDiagCat;

typedef enum PanDiagSeverity{
	PAN_DIAG_SEV_WARN = 0,
	PAN_DIAG_SEV_FATAL = 1,
	PAN_DIAG_SEV_ERROR = 2,
}PanDiagSeverity;

typedef enum PanDiagCode{
    // অপরিচিত অক্ষর পাওয়া গেছে `%s`
    LEXER_INVALID_CHAR,
    // অপরিচিত অক্ষর পাওয়া গেছে এই অবস্থানেঃ %llu নং লাইনে %llu নং স্তম্ভে
    LEXER_INVALID_CHAR_AT,
    // অভ্যন্তরীণ গোলমাল: যৌক্তিক রাশিমালা তৈরি বিফল হয়েছে
    PARSER_IME_LOGICAL_EXPR,
    // অভ্যন্তরীণ গোলমাল: মান নির্ধারণ রাশিমালা তৈরি বিফল হয়েছে
    PARSER_IME_ASSIGN_EXPR,
    // অভ্যন্তরীণ গোলমাল: দ্বিমুখী রাশিমালা তৈরি বিফল হয়েছে
    PARSER_IME_BINARY_EXPR,
    // অভ্যন্তরীণ গোলমাল: একমুখী রাশিমালা তৈরি বিফল হয়েছে
    PARSER_IME_UNARY_EXPR,
    // অভ্যন্তরীণ গোলমাল: সূচকীয় রাশিমালা তৈরি বিফল হয়েছে
    PARSER_IME_SUBSCRIPT_EXPR,
    // অভ্যন্তরীণ গোলমাল: সত্যমান রাশি তৈরি বিফল হয়েছে
    PARSER_IME_BOOL_EXPR,
    // অভ্যন্তরীণ গোলমাল: নিল রাশি তৈরি বিফল হয়েছে
    PARSER_IME_NIL_EXPR,
    // অভ্যন্তরীণ গোলমাল: সংখ্যা রাশি তৈরি বিফল হয়েছে
    PARSER_IME_NUM_EXPR,
    // অভ্যন্তরীণ গোলমাল: কথা রাশি তৈরি বিফল হয়েছে
    PARSER_IME_STR_EXPR,
    // অভ্যন্তরীণ গোলমাল: চলরাশি তৈরি বিফল হয়েছে
    PARSER_IME_IDENT_EXPR,
    // অভ্যন্তরীণ গোলমাল: গুচ্ছ রাশিমালা তৈরি বিফল হয়েছে
    PARSER_IME_GROUP_EXPR,
    // অভ্যন্তরীণ গোলমাল: তালিকা রাশিমালা তৈরি বিফল হয়েছে
    PARSER_IME_ARRAY_EXPR,
    // অভ্যন্তরীণ গোলমাল: ছক রাইমালা তৈরি বিফল হয়েছে
    PARSER_IME_MAP_EXPR,
    // অভ্যন্তরীণ গোলমাল: কাজের ডাক রাশিমালা তৈরি বিফল হয়েছে
    PARSER_IME_CALL_EXPR,
    // অভ্যন্তরীণ গোলমাল: ফেরাও বিবৃতি তৈরি বিফল হয়েছে
    PARSER_IME_RETURN_STMT,
    // অভ্যন্তরীণ গোলমাল: ভাঙো বিবৃতি তৈরি বিফল হয়েছে
    PARSER_IME_BREAK_STMT,
    // অভ্যন্তরীণ গোলমাল: চালাও বিবৃতি তৈরি বিফল হয়েছে
    PARSER_IME_CONTINUE_STMT,
    // অভ্যন্তরীণ গোলমাল: কাজ বিবৃতি তৈরি বিফল হয়েছে
    PARSER_IME_FUNC_STMT,
    // অভ্যন্তরীণ গোলমাল: আনয়ন বিবৃতি তৈরি বিফল হয়েছে
    PARSER_IME_IMPORT_STMT,
    // অভ্যন্তরীণ গোলমাল: যদি-তাহলে বিবৃতি তৈরি বিফল হয়েছে
    PARSER_IME_IF_STMT,
    // অভ্যন্তরীণ গোলমাল: যতক্ষণ-করো বিবৃতি তৈরি বিফল হয়েছে
    PARSER_IME_WHILE_STMT,
    // অভ্যন্তরীণ গোলমাল: চলরাশি তৈরি বিবৃতি তৈরি বিফল হয়েছে
    PARSER_IME_LET_STMT,
    // অভ্যন্তরীণ গোলমাল: রাশিমালা বিবৃতি তৈরি বিফল হয়েছে
    PARSER_IME_EXPR_STMT,
    // অভ্যন্তরীণ গোলমাল: পরিচিতি বিবৃতি তৈরি বিফল হয়েছে
    PARSER_IME_DEBUG_STMT,
    // অভ্যন্তরীণ গোলমাল: বিবৃতি গুচ্ছ তৈরি বিফল হয়েছে
    PARSER_IME_BLOCK_STMT,
    // অভ্যন্তরীণ গোলমাল: উৎসের সদস্য রাশি তৈরি বিফল হয়েছে
    PARSER_IME_MOD_CHILD,
    // রাশিমালা পাওয়া উচিত ছিল
    PARSER_EXPECT_EXPR,
    // সেমিকোলন ';' পাওয়া উচিত ছিল
    PARSER_EXPECT_SEMICOLON,
    // 'কাজ'/'func'/'kaj' এর পরে কাজের নাম পাওয়া উচিত ছিল
    PARSER_EXPECT_FUNC_NAME,
    // কাজের নামের পর একটি প্রথম বন্ধনী '(' পাওয়া উচিত ছিল
    PARSER_EXPECT_LPAREN_FUNC_NAME,
    // কাজের নামের পর কাজের প্রাপ্তিমান পাওয়া উচিত ছিল
    PARSER_EXPECT_FUNC_PARAM,
    // কাজের প্রাপ্তিমানগুলির পর (যদি থাকে) একটি প্রথম বন্ধনী ')' পাওয়া উচিত ছিল
    PARSER_EXPECT_FUNC_RPAREN,
    // কাজের ডাক রাশিমালাতে প্রেরণমানগুলির পর একটি প্রথম বন্ধনী ')' পাওয়া উচিত ছিল
    PARSER_EXPECT_CALL_RPAREN,
    // 'ধরি'/'let'/'dhor' -এর পর চলরাশির নাম পাওয়া উচিত ছিল
    PARSER_EXPECT_LET_IDENT,
    // চলরাশি তৈরির সময় চলরাশির নামের পর একটি সমান চিহ্ন '=' পাওয়া উচিত ছিল
    PARSER_EXPECT_EQ_LET_IDENT,
    // যদি-তাহলে বিবৃতির শর্তের পর 'তাহলে'/'then'/'tahole' পাওয়া উচিত ছিল
    PARSER_EXPECT_THEN_IFCOND,
    // বিবৃতি গুচ্ছের পর 'শেষ'/'end'/'shesh' পাওয়া উচিত
    PARSER_EXPECT_END_BLOCK,
    // বিবৃতি গুচ্ছের পর 'নাহলে'/'else'/'nahole' পাওয়া উচিত
    PARSER_EXPECT_NOOP_ELSE_BLOCK,
    // বিবৃতি গুচ্ছের পর 'শেষ'/'end'/'shesh' পাওয়া উচিত
    PARSER_EXPECT_NOOP_END_BLOCK,
    // বিবৃতি গুচ্ছের পর তৃতীয় বন্ধনী '}' পাওয়া উচিত ছিল
    PARSER_EXPECT_RBRACE_BLOCK,
    // যতক্ষণ-করো বিবৃতির শর্তের পর 'করো'/'do'/'koro' পাওয়া উচিত ছিল
    PARSER_EXPECT_DO_WHILECOND,
    // খালি ফেরাও এর পর একটি সেমিকোলন ';' পাওয়া উচিত ছিল
    PARSER_EXPECT_SEMICOLON_NILRETURN,
    // গুচ্ছ রাশিমালার পর প্রথম বন্ধনী ')' পাওয়া উচিত ছিল
    PARSER_EXPECT_RPAREN_GROUP,
    // ছকের সূচক-মান যুগলগুলির শেষে তৃতীয় বন্ধনী '}' পাওয়া উচিত ছিল
    PARSER_EXPECT_RBRACE_MAP,
    // ছকের সূচক-মান যুগলের পর কমা ',' পাওয়া উচিত ছিল
    PARSER_EXPECT_COMMA_MAPPAIR,
    // ছকের সূচকের পর কোলন ':' পাওয়া উচিত ছিল
    PARSER_EXPECT_COLON_MAPKEY,
    // তালিকার উপাদানগুলির শেষে দ্বিতীয় বন্ধনী ']' পাওয়া উচিত ছিল
    PARSER_EXPECT_RBRACKET_ARRAY,
    // তালিকার উপাদানের পর কমা ',' পাওয়া উচিত ছিল
    PARSER_EXPECT_COMMA_ARRAYITEM,
    // উৎসের সদস্যের নাম পাওয়া উচিত ছিল
    PARSER_EXPECT_MOD_CHILD,
    // সূচকীয় রাশির পর দ্বিতীয় বন্ধনী ']' পাওয়া উচিত ছিল
    PARSER_EXPECT_RBRACKET_SUBEXPR,
    // সূচকীয় মানে অবৈধ সূচক
    PARSER_INVALID_SUBEXPR_INDEX,
    // কাজ চালানোর রাশিমালাতে ২৫৫-টির বেশি প্রেরণ মান ব্যবহার করা যায় না
    PARSER_CALL_TOOMANY_ARGS,
    // অবৈধ মান নির্ধারণ রাশিমালা, শুধুমাত্র চলরাশি এবং সূচকীয় রাশির মান নির্ধারণ করা যায়
    PARSER_INVALID_ASSIGN,
    // গুণ-ভাগ-ভাগশেষ রাশিমালা পড়ার সময় দ্বিমুখী রাশিমালার ডান দিক থেকে অবৈধ রাশিমালা পাওয়া গেছে
    PARSER_INVALID_MULDIV_RIGHT,
    // ঘাত রাশিমালা পড়ার সময় দ্বিমুখী রাশিমালার ডান দিক থেকে অবৈধ রাশিমালা পাওয়া গেছে
    PARSER_INVALID_EXPO_RIGHT,
    // অবৈধ সংখ্যা পাওয়া গেছে
    PARSER_MALFORMED_NUMBER,
    // উৎস যে নামে আনা হবে তার নাম পাওয়া উচিত ছিল
    PARSER_EXPECT_IMPORT_NAME,
    // %s
    PARSER_TEMPLATE,
    // অভ্যন্তরীণ গোলমাল: স্ট্রিং তৈরি বিফল হয়েছে
    COMPILER_IME_STRING,
    // দ্বিমুখী রাশিমালার বামদিকের রাশিমালা কম্পাইল বিফল হয়েছে
    COMPILER_LEFT_BINARY,
    // দ্বিমুখী রাশিমালার ডানদিকের রাশিমালা কম্পাইল বিফল হয়েছে
    COMPILER_RIGHT_BINARY,
    // যৌক্তিক রাশিমালার বামদিকের রাশিমালা কম্পাইল বিফল হয়েছে
    COMPILER_LEFT_LOGICAL,
    // যৌক্তিক রাশিমালার ডানদিকের রাশিমালা কম্পাইল বিফল হয়েছে
    COMPILER_RIGHT_LOGICAL,
    // একমুখী রাশিমালা কম্পাইল বিফল হয়েছে
    COMPILER_UNARY_EXPR,
    // তালিকার উপাদান রাশি কম্পাইল বিফল হয়েছে
    COMPILER_ARRAY_ITEM,
    // ছকের সূচক রাশি কম্পাইল বিফল হয়েছে
    COMPILER_MAP_KEY,
    // ছকের মান রাশি কম্পাইল বিফল হয়েছে
    COMPILER_MAP_VALUE,
    // প্রাথমিক স্তরের বিবৃতি কম্পাইল বিফল হয়েছে
    COMPILER_TOP_STMT,
    // মান নির্ধারণ রাশিমালার মান কম্পাইল বিফল হয়েছে
    COMPILER_ASSIGN_VALUE,
    // মান নির্ধারণের রাশিমালার সূচকীয় রাশির সূচক কম্পাইল বিফল হয়েছে
    COMPILER_SUB_ASSIGN_SUBINDEX,
    // মান নির্ধারণ রাশিমালার সূচকীয় রাশির মুল মান কম্পাইল বিফল হয়েছে
    COMPILER_SUB_ASSIGN_SUBVALUE,
    // সূচকীয় রাশির সূচক কম্পাইল বিফল হয়েছে
    COMPILER_SUBS_INDEX,
    // সূচকীয় রাশির মুল মান কম্পাইল বিফল হয়েছে
    COMPILER_SUBS_VALUE,
    // মান নির্ধারণ রাশিমালার সূচকীয় রাশির নতুন মান কম্পাইল বিফল হয়েছে
    COMPILER_SUB_ASSIGN_VALUE,
    // কাজের ডাক রাশিমালার কাজের নাম রাশিমালা কম্পাইল বিফল হয়েছে
    COMPILER_CALL_EXPR_CALLE,
    // কাজের ডাক রাশিমালার প্রেরণমান রাশিমালা কম্পাইল বিফল হয়েছে
    COMPILER_CALL_EXPR_ARG,
    // উৎসের সদস্য ব্যবহারের রাশিমালা কম্পাইল বিফল হয়েছে
    COMPILER_MOD_EXPR,
    // রাশিমালা বিবৃতি কম্পাইল বিফল হয়েছে
    COMPILER_EXPR_STMT,
    // পরিচিতি বিবৃতি কম্পাইল বিফল হয়েছে
    COMPILER_DEBUG_STMT,
    // চলরাশি তৈরির বিবৃতি কম্পাইল বিফল হয়েছে
    COMPILER_LET_STMT,
    // বিবৃতি গুচ্ছ কম্পাইল বিফল হয়েছে
    COMPILER_BLOCK_STMT,
    // যদি-তাহলে বিবৃতির শর্ত রাশিমালা কম্পাইল বিফল হয়েছে
    COMPILER_IF_COND,
    // যদি-তাহলে বিবৃতির তাহলে -র বিবৃতি গুচ্ছ কম্পাইল বিফল হয়েছে
    COMPILER_IF_THEN_BLOCK,
    // যদি-তাহলে বিবৃতির নাহলে -র বিবৃতি গুচ্ছ কম্পাইল বিফল হয়েছে
    COMPILER_IF_ELSE_BLOCK,
    // যতক্ষণ-করো বিবৃতির শর্ত রাশিমালা কম্পাইল বিফল হয়েছে
    COMPILER_WHILE_COND,
    // যতক্ষণ-করো বিবৃতির বিবৃতিগুচ্ছ কম্পাইল বিফল হয়েছে
    COMPILER_WHILE_BLOCK,
    // কাজের বিবৃতিগুচ্ছ কম্পাইল বিফল হয়েছে
    COMPILER_FUNC_BLOCK,
    // কাজ বিবৃতি কম্পাইল বিফল হয়েছে
    COMPILER_FUNC_STMT,
    // ফেরাও বিবৃতির রাশিমালা কম্পাইল বিফল হয়েছে
    COMPILER_RETURN_STMT,
    // উৎস আনয়ন বিবৃতি কম্পাইল বিফল হয়েছে
    COMPILER_MODULE_STMT,
    // ভাঙো বিবৃতি কম্পাইল বিফল হয়েছে
    COMPILER_BREAK_STMT,
    // চালাও বিবৃতি কম্পাইল বিফল হয়েছে
    COMPILER_CONTINUE_STMT,
    // শর্তজাতিয় বিবৃতি গুচ্ছের সংখ্যা অনেক বেশি
    COMPILER_COND_JUMP_BIG,
    // চলরাশি তৈরির সময় চলরাশির মান সেই নামের চলরাশির মান হতে পারে না
    COMPILER_VAR_OWN_INIT,
    // অবৈধ রাশিমালা পাওয়া গেছে
    COMPILER_INVALID_EXPR,
    // '%s' নামের চলরাশি এইখানে আগের থেকেই আছে 
    COMPILER_VAR_EXISTS,
    // অনেক বেশি স্থানীয় চলরাশি পাওয়া গেছে
    COMPILER_LOCAL_TOO_MANY,
    // অনেক বেশি স্থানীয় এবং নিকটস্থ স্থানীয় চলরাশি পাওয়া গেছে
    COMPILER_CLOSURE_TOO_MANY,
    // যতক্ষণ-করো বিবৃতি কম্পাইল করার জন্য কিছু প্রয়োজন অভ্যন্তরীণ তথ্য তৈরি বিফল হয়েছে
    COMPILER_WHILE_BLOCK_CTX,
    // প্রাথমিক স্তরে ফেরাও বিবৃতি ব্যবহার করা যায় না
    COMPILER_RETURN_TOP_LEVEL,
    // অভ্যন্তরীণ গোলমাল: প্রয়োজনীয় প্রস্তুতি ছাড়াই পঙক্তি চালু হয়েছে
    COMPILER_IME_NOCTX,
    // উৎস বিবৃতির উৎসের পথ কম্পাইল বিফল হয়েছে
    COMPILER_IMPORT_PATH,
    // চলরাশির নাম কম্পাইল বিফল হয়েছে
    COMPILER_IDENT_NAME,
    // %s
    COMPILER_TEMPLATE,
    // কথা রাশির মধ্যে অজানা বিশেষ চিহ্ন পাওয়া গেছে
    STR_UNKNOWN_ESCAPE,
    // কথা রাশির মধ্যে বিশেষ চিহ্নে অবৈধ হেক্স অক্ষর পাওয়া গেছে
    STR_INVALID_HEX,
    // অভ্যন্তরীণ গোলমাল: বিশেষ চিহ্নযুক্ত কথা রাশি তৈরি বিফল হয়েছে
    STR_IME_ESCAPED_STR,
    // কথা রাশির শেষে অসম্পূর্ণ বিশেষ চিহ্ন পাওয়া গেছে
    STR_INCOMPLETE_ESCAPE_STR,
    // \\uHHHH -জাতিয় বিশেষ চিহ্ন পড়ার সময় তার low-surrogate \\uHHHH চিহ্ন আশা করা হয়েছিল কিন্তু তা পাওয়া যায়নি
    STR_NO_LOW_SURROGATE,
    // \\uHHHH -জাতিয় বিশেষ চিহ্নে শুধুমাত্র একলা low-surrogate পাওয়া গেছে
    STR_LONE_LOW_SURROGATE,
    // অবৈধ \\uHHHH -জাতিয় low-surrogate চিহ্ন পাওয়া গেছে
    STR_INVALID_LOW_SURROGATE,
    // কথার মধ্যে অবৈধ \\uHHHHHHHH -জাতিয় বিশেষ চিহ্ন পাওয়া গেছে
    STR_INVALID_H8,
    // অভ্যন্তরীণ গোলমাল: বিশেষ চিহ্নযুক্ত কথা রাশির জন্য প্রয়োজনীয় মেমোরি পাওয়া যায়নি
    STR_IME_ESCAPED_OUTPUT,
    // অভ্যন্তরীণ গোলমাল: পঙক্তি স্ক্রিপ্ট চালানোর প্রাথমিক প্রস্তুতি বিফল হয়েছে
    RT_IME_PRIMARY_SETUP,
    // শুন্য দিয়ে ভাগ করা সম্ভব নয়
    RT_DIV_ZERO,
    // পঙক্তি অভ্যন্তরীণ গোলযোগঃ স্ট্যাক ওভারফ্লো
    RT_STACK_OVERFLOW,
    // পঙক্তি অভ্যন্তরীণ গোলযোগঃ স্ট্যাক আন্ডারফ্লো
    RT_STACK_UNDERFLOW,
    // দ্বিমুখী রাশিমালার মান গণনা বিফল হয়েছে
    RT_BINARY_OP,
    // কথা রাশিযুক্ত দ্বিমুখী রাশিমালার মান গণনা বিফল হয়েছে
    RT_STR_BINARY_OP,
    // অবৈধ দ্বিমুখী রাশিমালা পাওয়া গেছে
    RT_INVALID_BINARY_OP,
    // অবৈধ তুলনামূলক রাশিমালা পাওয়া গেছে
    RT_INVALID_COMP_OP,
    // কাজের ডাকের প্রেরণমান আর কাজের প্রাপ্তিমানের সংখ্যা সমান নয়ঃ কাজের জন্য %llu-টি প্রেরণমান দরকার ছিল কিন্তু %llu-টি দেওয়া হয়েছে
    RT_ARG_PARAM_NOTEQ,
    //  %s সাধারণ কাজের ডাকের প্রেরণমান আর কাজের প্রাপ্তিমানের সংখ্যা সমান নয়ঃ কাজের জন্য %llu-টি প্রেরণমান দরকার ছিল কিন্তু %llu-টি দেওয়া হয়েছে
    RT_NATIVE_ARG_PARAM_NOTEQ,
    // তালিকার জন্য সূচক সংখ্যা হওয়া উচিত ছিল কিন্তু প্রাপ্ত সূচকের ধরন হল %s
    RT_INVALID_ARR_INDEX_NOTNUM,
    // তালিকার জন্য সূচক ধনাত্মক পূর্ণসংখ্যা হওয়া উচিত ছিল কিন্তু প্রাপ্ত সূচক হল '%f'
    RT_INVALID_ARR_INDEX,
    // তালিকার সূচকের মান তালিকার উপাদান সংখ্যার বেশি, এই তালিকার বৈধ সূচক হল ০ থেকে %llu কিন্তু দেওয়া হয়েছে %llu
    RT_ARR_INDEX_OUT_RANGE,
    // '%s'-জাতিয় মান ছকের সূচক হিসাবে ব্যবহার সম্ভব নয়
    RT_INVALID_MAP_KEY,
    // ছকের মধ্যে সূচকের মান খুঁজে পাওয়া গেল না
    RT_MAP_KEY_NOT_FOUND,
    // %s-জাতিয় রাশির সূচকীয় মান ব্যবহার সম্ভব নয়
    RT_INVALID_SUBS_TARGET,
    // %s-জাতিয় রাশির সূচকীয় মান নির্ধারণ সম্ভব নয়
    RT_INVALID_SUBASSIGN,
    // উৎস আনয়নের উৎসের স্থান একটি কথা রাশি হওয়া উচিত ছিল কিন্তু তার বদলে একটি %s পাওয়া গেল
    RT_INVALID_IMPORT_PATH,
    // বর্তমানে শুধুমাত্র সাধারণ উৎসগুলি ব্যবহার করা যায়
    RT_ONLY_STDLIB,
    // অভ্যন্তরীণ গোলমাল: উৎস আনয়নের জন্য প্রয়োজনীয় প্রস্তুতি বিফল হয়েছে
    RT_IME_MODULE,
    // অভ্যন্তরীণ গোলমাল: স্থানীয় মান ব্যবহারের জন্য প্রয়োজনীয় প্রস্তুতি বিফল হয়েছে
    RT_IME_CLOSURE,
    // শুধুমাত্র চলরাশির মান নির্ধারণ করা যায়, কিন্তু একটি %s-জাতিয় রাশি পাওয়া গেছে
    RT_INVALID_VAR_DECLARE,
    // %s নামের কোনো চলরাশি খুঁজে পাওয়া গেল না
    RT_UNDEF_GET_VAR,
    // %s নামের চলরাশির মান নির্ধারণ সম্ভব নয়, এই নামের কোনো চলরাশি খুঁজে পাওয়া গেল না
    RT_UNDEF_SET_VAR,
    // কাজের ডাক বিফল হয়েছে
    RT_CALL_FAIL,
    // শুধুমাত্র কাজকেই কাজের ডাকে ব্যবহার করা যায় কিন্তু একটি %s-জাতিয় রাশি পাওয়া গেছে
    RT_INVALID_CALLEE,
    // প্রচুর পরিমাণ কাজের ডাক একইসঙ্গে ব্যবহৃত হচ্ছে
    RT_CALLSTACK_OVERFLOW,
    // শুধুমাত্র কাজের ক্ষেত্রেই স্থানীয় ও প্রতিবেশী চলরাশি প্রস্তুতি নেওয়া সম্ভব কিন্তু একটি %s-জাতিয় রাশি পাওয়া গেছে
    RT_ONLY_FUNC_CLOSURE,
    // অভ্যন্তরীণ গোলমাল: তালিকা তৈরি বিফল হয়েছে
    RT_IME_ARRAY,
    // অভ্যন্তরীণ গোলমাল: ছক তৈরি বিফল হয়েছে
    RT_IME_MAP,
    // শুধুমাত্র উৎস থেকেই সদস্য পাওয়া যায় কিন্তু একটি %s-জাতিয় রাশি থেকে সদস্য নেওয়ার চেষ্টা করা হয়েছে
    RT_ONLY_MOD_CHILD,
    // উৎসের থেকে অবৈধ সদস্য ব্যবহারের চেষ্টা করা হয়েছে %s-জাতিয় রাশি পাওয়া গেছে
    RT_INVALID_MOD_CHILD,
    // অজানা উৎস %s পাওয়া গেছে
    RT_UNKNOWN_MOD,
    // উৎসের অজানা সদস্য পাওয়া গেছে
    RT_UNKNOWN_CHILD,
    // %s
    RT_TEMPLATE,
    // তালিকা.বর্তমান(তালিকার_নাম, উপাদান) কাজে দুটি প্রেরণমান পাওয়া উচিত ছিল, কিন্তু %lluটি প্রেরণ মান দেওয়া হয়েছে
    RT_STDARR_EXISTS_TWO_ARGS,
    // 'তালিকা.বর্তমান(তালিকার_নাম, উপাদান)' কাজের প্রথম প্রেরণমান একটি তালিকা হওয়া উচিত ছিল কিন্তু একটি %s-জাতিয় রাশি পাওয়া গেছে
    RT_STDARR_EXISTS_FIRST_ARR,
    // তালিকা.সংযোগ(তালিকার_নাম, সূচক, উপাদান) কাজের প্রথম প্রেরণমান একটি তালিকা হওয়া উচিত ছিল কিন্তু একটি %s-জাতিয় রাশি পাওয়া
    RT_STDARR_ADD_FIRST_ARR,
    // তালিকা.সংযোগ(তালিকার_নাম, সূচক, উপাদান) কাজের সূচকটি একটি সংখ্যা উচিত ছিল কিন্তু একটি %s-জাতিয় রাশি পাওয়া গেছে
    RT_STDARR_ADD_INVALID_IDX_TYPE,
    // তালিকা.সংযোগ(তালিকার_নাম, সূচক, উপাদান) কাজের সূচকটি একটি ধনাত্মক পূর্ণ সংখ্যা সংখ্যা হওয়া উচিত ছিল কিন্তু %f পাওয়া গেছে
    RT_STDARR_ADD_INVALID_NUMIDX,
    // তালিকা.সংযোগ(তালিকার_নাম, সূচক, উপাদান) কাজের সূচকটি তালিকার আয়তনের থেকে বড়, বৈধ সূচক হল ০ থেকে %llu
    RT_STDARR_ADD_INDEX_OUT_RANGE,
    // অভ্যন্তরীণ গোলমাল: তালিকা.সংযোগ(তালিকার_নাম, সূচক, উপাদান) কাজে প্রদত্ত তালিকার মধ্যে উপাদানগুলি খুঁজে পাওয়া গেলো না
    RT_IME_STDARR_ADD_ARRAY_ITEMS_OUTSYNC,
    // তালিকা.সূচক(তালিকার_নাম, উপাদান) কাজের প্রথম প্রেরণমান একটি তালিকা হওয়া উচিত ছিল কিন্তু একটি %s-জাতিয় রাশি পাওয়া
    RT_STDARR_INDEX_FIRST_ARR,
    // তালিকা.বিয়োগ(তালিকার_নাম, সূচক) কাজের প্রথম প্রেরণমান একটি তালিকা হওয়া উচিত ছিল কিন্তু একটি %s-জাতিয় রাশি পাওয়া
    RT_STDARR_DELETE_FIRST_ARR,
    // তালিকা.বিয়োগ(তালিকার_নাম, সূচক) কাজের সূচকটি একটি সংখ্যা উচিত ছিল কিন্তু একটি %s-জাতিয় রাশি পাওয়া গেছে
    RT_STDARR_DELETE_INVALID_IDX_TYPE,
    // তালিকা.বিয়োগ(তালিকার_নাম, সূচক) কাজের সূচকটি একটি ধনাত্মক পূর্ণ সংখ্যা সংখ্যা হওয়া উচিত ছিল কিন্তু %f পাওয়া গেছে
    RT_STDARR_DELETE_INVALID_NUMIDX,
    // তালিকা.বিয়োগ(তালিকার_নাম, সূচক) কাজের সূচকটি তালিকার আয়তনের থেকে বড়, বৈধ সূচক হল ০ থেকে %llu
    RT_STDARR_DELETE_INDEX_OUT_RANGE,
    // অভ্যন্তরীণ গোলমাল: তালিকা.বিয়োগ(তালিকার_নাম, সূচক) কাজে প্রদত্ত তালিকার মধ্যে উপাদানগুলি খুঁজে পাওয়া গেলো না
    RT_IME_STDARR_DELETE_ARRAY_ITEMS_OUTSYNC,
    // তালিকা.কাটো(তালিকার_নাম) কাজের প্রথম প্রেরণমান একটি তালিকা হওয়া উচিত ছিল কিন্তু একটি %s-জাতিয় রাশি পাওয়া
    RT_STDARR_TRIM_FIRST_ARR,
    // তালিকা.কাটো(তালিকার_নাম) কাজের মধ্যে দেওয়া তালিকাতে কোনো উপাদান নেই
    RT_STDARR_TRIM_ARR_EMPTY,
    // অভ্যন্তরীণ গোলমাল: তালিকা.কাটো(তালিকার_নাম) কাজে প্রদত্ত তালিকার মধ্যে উপাদানগুলি খুঁজে পাওয়া গেলো না
    RT_IME_STDARR_TRIM_ARRAY_ITEMS_OUTSYNC,
    // নথি.বর্তমান(নথির_পথ) কাজের প্রথম প্রেরণমান অর্থাৎ নথির পথ একটি কথারাশি হওয়া উচিত ছিল কিন্তু একটি %s-জাতিয় রাশি পাওয়া
    RT_STDFILE_EXISTS_FIRST_STR,
    // নথি.পড়ো(নথির_পথ) কাজের প্রথম প্রেরণমান অর্থাৎ নথির পথ কথারাশি হওয়া উচিত ছিল কিন্তু একটি %s-জাতিয় রাশি পাওয়া
    RT_STDFILE_READ_FIRST_STR,
    // নথি.পড়ো(নথির_পথ) কাজে প্রদত্ত নথি '%s' খুঁজে পাওয়া গেলো না
    RT_STDFILE_READ_FILE_NOT_FOUND,
    // নথি.পড়ো(নথির_পথ) কাজে প্রদত্ত নথির পথ '%s' ফাইল নয়
    RT_STDFILE_READ_ISNOT_FILE,
    // অভ্যন্তরীণ গোলমাল: নথি.পড়ো(নথির_পথ) কাজে দেওয়া নথি '%s' পড়া বিফল হয়েছে
    RT_IME_STDFILE_FILE_READ_FILE,
    // অভ্যন্তরীণ গোলমাল: নথি.পড়ো(নথির_পথ) কাজের নথি পড়ার সময় নথির তথ্যের কথারাশি তৈরি বিফল হয়েছে
    RT_IME_STDFILE_READ_STR,
    // নথি.লেখো(নথির_পথ, তথ্য) কাজের প্রথম প্রেরণমান অর্থাৎ নথির পথ একটি কথারাশি হওয়া উচিত ছিল কিন্তু একটি %s-জাতিয় রাশি পাওয়া
    RT_STDFILE_WRITE_FILENAME_STR,
    // নথি.লেখো(নথির_পথ, তথ্য) কাজের দ্বিতীয় প্রেরণমান অর্থার তথ্য একটি কথারাশি হওয়া উচিত ছিল কিন্তু একটি %s-জাতিয় রাশি পাওয়া
    RT_STDFILE_WRITE_CONTENT_STR,
    // নথি.লেখো(নথির_পথ, তথ্য) কাজে প্রদত্ত নথি '%s' খুঁজে পাওয়া গেলো না
    RT_STDFILE_WRITE_FILE_NOT_FOUND,
    // নথি.লেখো(নথির_পথ, তথ্য) কাজে প্রদত্ত নথির পথ '%s' ফাইল নয়
    RT_STDFILE_WRITE_ISNOT_FILE,
    // অভ্যন্তরীণ গোলমাল: নথি.লেখো(নথির_পথ, তথ্য) কাজে '%s' নথিতে তথ্য লেখা বিফল হয়েছে
    RT_IME_STDFILE_WRITE_WRITE_FAIL,
    // নথি.নতুন(নথির_পথ) কাজের প্রথম প্রেরণমান অর্থাৎ নথির পথ একটি কথারাশি হওয়া উচিত ছিল কিন্তু একটি %s-জাতিয় রাশি পাওয়া
    RT_STDFILE_CREATEFILE_FILENAME_STR,
    // অভ্যন্তরীণ গোলমাল: নথি.নতুন(নথির_পথ) কাজে '%s' নথি তৈরি বিফল হয়েছে
    RT_IME_STDFILE_CREATEFILE_CREATE_FAIL,
    // নথি.নতুন_ফোল্ডার(ফোল্ডার_পথ) কাজের প্রথম প্রেরণমান অর্থাৎ ফোল্ডারের পথ একটি কথারাশি হওয়া উচিত ছিল কিন্তু একটি %s-জাতিয় রাশি পাওয়া
    RT_STDFILE_CREATEDIR_FILENAME_STR,
    // অভ্যন্তরীণ গোলমাল: নথি.নতুন_ফোল্ডার(ফোল্ডার_পথ) কাজে '%s' ফোল্ডার তৈরি বিফল হয়েছে
    RT_IME_STDFILE_CREATEDIR_CREATE_FAIL,
    // ছক.বর্তমান(ছকের_নাম, সূচক) কাজের প্রথম প্রেরণমান অর্থাৎ ছকের_নাম একটি ছক হওয়া উচিত ছিল কিন্তু একটি %s-জাতিয় রাশি পাওয়া
    RT_STDMAP_EXISTS_FIRST_NOTMAP,
    // ছক.বর্তমান(ছকের_নাম, সূচক) কাজের দ্বিতীয় প্রেরণমান অর্থাৎ সূচক একটি %s-জাতিয় রাশি যা ছকের সূচক হওয়ার অনুপযোগী
    RT_STDMAP_EXISTS_INVALID_KEY,
    // ছক.সূচকগুলি(ছকের_নাম) কাজের প্রথম প্রেরণমান অর্থাৎ ছকের_নাম একটি ছক হওয়া উচিত ছিল কিন্তু একটি %s-জাতিয় রাশি পাওয়া
    RT_STDMAP_KEYS_FIRST_NOTMAP,
    // অভ্যন্তরীণ গোলমাল: ছক.সূচকগুলি(ছকের_নাম) কাজে সূচকগুলি নিয়ে একটি তালিকা তৈরি বিফল হয়েছে
    RT_IME_STDMAP_KEYS_ARR_CREATE,
    // ছক.মানগুলি(ছকের_নাম) কাজের প্রথম প্রেরণমান অর্থাৎ ছকের_নাম একটি ছক হওয়া উচিত ছিল কিন্তু একটি %s-জাতিয় রাশি পাওয়া
    RT_STDMAP_VALUES_FIRST_NOTMAP,
    // অভ্যন্তরীণ গোলমাল: ছক.মানগুলি(ছকের_নাম) কাজে মানগুলি নিয়ে একটি তালিকা তৈরি বিফল হয়েছে
    RT_IME_STDMAP_VALUES_ARR_CREATE,
    // ছক.বিয়োগ(ছকের_নাম, সূচক) কাজের প্রথম প্রেরণমান অর্থাৎ ছকের_নাম একটি ছক হওয়া উচিত ছিল কিন্তু একটি %s-জাতিয় রাশি পাওয়া
    RT_STDMAP_DELETE_FIRST_NOTMAP,
    // ছক.বিয়োগ(ছকের_নাম, সূচক) কাজের দ্বিতীয় প্রেরণমান অর্থাৎ সূচক একটি %s-জাতিয় রাশি যা ছকের সূচক হওয়ার অনুপযোগী
    RT_STDMAP_DELETE_INVALID_KEY,
    // ছক.বিয়োগ(ছকের_নাম, সূচক) কাজে ছকের মধ্যে সূচক খুঁজে পাওয়া গেলো না
    RT_STDMAP_DELETE_KEY_NOTFOUND,
    // অভ্যন্তরীণ গোলমাল: গনিত উৎস আনয়নের প্রয়োজনীয় ধ্রুবকগুলির (যেমনঃ পাই, ই) প্রস্তুতি বিফল হয়েছে
    RT_IME_STDMATH_PI_STR,
    // অভ্যন্তরীণ গোলমাল: গনিত উৎস আনয়নের প্রয়োজনীয় ধ্রুবকগুলির (যেমনঃ ই, পাই) প্রস্তুতি বিফল হয়েছে
    RT_IME_STDMATH_E_STR,
    // গণিত.বর্গমূল(ক) কাজের প্রেরণমান 'ক' একটি সংখ্যা হওয়া উচিত ছিল কিন্তু একটি %s-জাতিয় রাশি দেওয়া হয়েছে
    RT_STDMATH_SQRT_NOT_NUM,
    // গণিত.লগদশ(ক) কাজের প্রেরণমান 'ক' একটি সংখ্যা হওয়া উচিত ছিল কিন্তু একটি %s-জাতিয় রাশি দেওয়া হয়েছে
    RT_STDMATH_LOG10_NOT_NUM,
    // গণিত.লগ(ক) কাজের প্রেরণমান 'ক' একটি সংখ্যা হওয়া উচিত ছিল কিন্তু একটি %s-জাতিয় রাশি দেওয়া হয়েছে
    RT_STDMATH_LOG_NOT_NUM,
    // গণিত.লগবেস(বেস, ক) কাজের প্রেরণমান 'বেস' একটি সংখ্যা হওয়া উচিত ছিল কিন্তু একটি %s-জাতিয় রাশি দেওয়া হয়েছে
    RT_STDMATH_LOGBASE_BASE_NOT_NUM,
    // গণিত.লগবেস(বেস, ক) কাজের প্রেরণমান 'ক' একটি সংখ্যা হওয়া উচিত ছিল কিন্তু একটি %s-জাতিয় রাশি দেওয়া হয়েছে
    RT_STDMATH_LOGBASE_NUMBER_NOT_NUM,
    // গণিত.গসাগু(ক, খ) কাজের প্রেরণমান 'ক' একটি সংখ্যা হওয়া উচিত ছিল কিন্তু একটি %s-জাতিয় রাশি দেওয়া হয়েছে
    RT_STDMATH_GCD_A_NOT_NUM,
    // গণিত.গসাগু(ক, খ) কাজের প্রেরণমান 'খ' একটি সংখ্যা হওয়া উচিত ছিল কিন্তু একটি %s-জাতিয় রাশি দেওয়া হয়েছে
    RT_STDMATH_GCD_B_NOT_NUM,
    // গণিত.লসাগু(ক, খ) কাজের প্রেরণমান 'ক' একটি সংখ্যা হওয়া উচিত ছিল কিন্তু একটি %s-জাতিয় রাশি দেওয়া হয়েছে
    RT_STDMATH_LCM_A_NOT_NUM,
    // গণিত.লসাগু(ক, খ) কাজের প্রেরণমান 'খ' একটি সংখ্যা হওয়া উচিত ছিল কিন্তু একটি %s-জাতিয় রাশি দেওয়া হয়েছে
    RT_STDMATH_LCM_B_NOT_NUM,
    // গণিত.সাইন(ক) কাজের প্রেরণমান 'ক' একটি সংখ্যা হওয়া উচিত ছিল কিন্তু একটি %s-জাতিয় রাশি দেওয়া হয়েছে
    RT_STDMATH_SIN_NOT_NUM,
    // গণিত.কস(ক) কাজের প্রেরণমান 'ক' একটি সংখ্যা হওয়া উচিত ছিল কিন্তু একটি %s-জাতিয় রাশি দেওয়া হয়েছে
    RT_STDMATH_COS_NOT_NUM,
    // গণিত.ট্যান(ক) কাজের প্রেরণমান 'ক' একটি সংখ্যা হওয়া উচিত ছিল কিন্তু একটি %s-জাতিয় রাশি দেওয়া হয়েছে
    RT_STDMATH_TAN_NOT_NUM,
    // গণিত.ট্যান(ক) কাজে %f ডিগ্রির মান অসংজ্ঞায়িত
    RT_STDMATH_TAN_RESULT_INVALID,
    // গণিত.ডিগ্রি(ক) কাজের প্রেরণমান 'ক' একটি সংখ্যা হওয়া উচিত ছিল কিন্তু একটি %s-জাতিয় রাশি দেওয়া হয়েছে
    RT_STDMATH_DEG_NOT_NUM,
    // গণিত.রেডিয়ান(ক) কাজের প্রেরণমান 'ক' একটি সংখ্যা হওয়া উচিত ছিল কিন্তু একটি %s-জাতিয় রাশি দেওয়া হয়েছে
    RT_STDMATH_RAD_NOT_NUM,
    // গণিত.সংখ্যা(ক) কাজের প্রেরণমান 'ক' একটি কথারাশি হওয়া উচিত ছিল কিন্তু একটি %s-জাতিয় রাশি দেওয়া হয়েছে
    RT_STDMATH_NUMBER_NOT_NUM,
    // অভ্যন্তরীণ গোলমাল: গণিত.সংখ্যা(ক) কাজে কথারাশিকে সংখ্যাতে পরিবর্তন করা বিফল হয়েছে
    RT_IME_STDMATH_NUMBER_CONVERT_FAIL,
    // গণিত.পরম(ক) কাজের প্রেরণমান 'ক' একটি সংখ্যা হওয়া উচিত ছিল কিন্তু একটি %s-জাতিয় রাশি দেওয়া হয়েছে
    RT_STDMATH_ABS_NOT_NUM,
    // গণিত.নিকটতম(ক) কাজের প্রেরণমান 'ক' একটি সংখ্যা হওয়া উচিত ছিল কিন্তু একটি %s-জাতিয় রাশি দেওয়া হয়েছে
    RT_STDMATH_ROUND_NOT_NUM,
    // গণিত.নিকট_ছোট(ক) কাজের প্রেরণমান 'ক' একটি সংখ্যা হওয়া উচিত ছিল কিন্তু একটি %s-জাতিয় রাশি দেওয়া হয়েছে
    RT_STDMATH_FLOOR_NOT_NUM,
    // গণিত.নিকট_বড়(ক) কাজের প্রেরণমান 'ক' একটি সংখ্যা হওয়া উচিত ছিল কিন্তু একটি %s-জাতিয় রাশি দেওয়া হয়েছে
    RT_STDMATH_CEIL_NOT_NUM,
    // গণিত.এলোমেলো(সর্বনিম্ন, সর্বোচ্চ) কাজের প্রেরণমান 'সর্বনিম্ন' একটি সংখ্যা হওয়া উচিত ছিল কিন্তু একটি %s-জাতিয় রাশি দেওয়া হয়েছে
    RT_STDMATH_RANDOM_MIN_NOT_NUM,
    // গণিত.এলোমেলো(সর্বনিম্ন, সর্বোচ্চ) কাজের প্রেরণমান 'সর্বোচ্চ' একটি সংখ্যা হওয়া উচিত ছিল কিন্তু একটি %s-জাতিয় রাশি দেওয়া হয়েছে
    RT_STDMATH_RANDOM_MAX_NOT_NUM,
    // অভ্যন্তরীণ গোলমাল: প্রকার(রাশি) কাজের প্রেরণমান রাশিটির ধরন জানা বিফল হয়েছে
    RT_IME_BUILTIN_TYPE_STRDUP,
    // অভ্যন্তরীণ গোলমাল: প্রকার(রাশি) কাজের ফেরত মানের জন্যে কথারাশি তৈরি বিফল হয়েছে
    RT_IME_BUILTIN_TYPE_STRRETURN,
    // আয়তন(রাশি) কাজে দেওয়া %s-জাতিয় রাশির আয়তন নির্ধারণ সম্ভব নয়
    RT_BUILTIN_LEN_INVALID_TYPE,
    // সংযোগ(তালিকা, উপাদান) কাজের প্রথম প্রেরণ অর্থাৎ তালিকা একটি তালিকা হওয়া উচিত ছিল কিন্তু একটি %s-জাতিয় রাশি পাওয়া গেছে
    RT_BUILTIN_APPEND_TARGET_NOT_ARRAY,
    // অভ্যন্তরীণ গোলমাল: সংযোগ(তালিকা, উপাদান) কাজে তালিকাতে নতুন উপাদান যোগ বিফল হয়েছে
    RT_IME_BUILTIN_APPEND_PUSH_FAILED,
    // গোলমাল(বার্তা) কাজে বার্তা প্রেরণমান একটি কথারাশি হওয়া উচিত কিন্তু একটি %s-জাতিয় রাশি দেওয়া হয়েছে
    RT_BUILTIN_ERROR_INVALID_TYPE,
    // অভ্যন্তরীণ গোলমাল: প্রেরণমান() কাজের ফেরতমানের জন্য নতুন তালিকা তৈরি বিফল হয়েছে
    RT_IME_BUILTIN_ARGS_ARRAY_CREATE_FAILED,
    // অভ্যন্তরীণ গোলমাল: প্রেরণমান() কাজের ফেরতনের তালিকারর উপাদান তৈরি বিফল হয়েছে
    RT_IME_BUILTIN_ARGS_ARRAY_ITEM_CREATE_FAILED,
    // অভ্যন্তরীণ গোলমাল: পরিবেশ.নাম() কাজে অপারেটিং সিস্টেমের নামের কথারাশি তৈরি বিফল হয়েছে
    RT_IME_STDSYS_NAME_STR,
    // অভ্যন্তরীণ গোলমাল: পরিবেশ.আর্চ() কাজে অপারেটিং সিস্টেমের আর্চের নামের কথারাশি তৈরি বিফল হয়েছে
    RT_IME_STDSYS_ARCH_STR,
    // অভ্যন্তরীণ গোলমাল: পরিবেশ.ব্যবহারকারী() কাজে অপারেটিং সিস্টেমের ব্যবহারকারীর নামের কথারাশি তৈরি বিফল হয়েছে
    RT_IME_STDSYS_USERNAME_STR,
    // অভ্যন্তরীণ গোলমাল: পরিবেশ.ঘর() কাজে অপারেটিং সিস্টেমের ব্যবহারকারীর হোম ডাইরেক্টরি/ফোল্ডারের নামের কথারাশি তৈরি বিফল হয়েছে
    RT_IME_STDSYS_HOMEDIR_STR,
    // অভ্যন্তরীণ গোলমাল: পরিবেশ.অবস্থান() কাজে বর্তমান ডাইরেক্টরি/ফোল্ডারের নামের কথারাশি তৈরি বিফল হয়েছে
    RT_IME_STDSYS_CURDIR_STR,
    // কথা.সূচক(ক, সূচক) কাজে প্রথম প্রেরণমান অর্থাৎ ক একটি কথারাশি হওয়া উচিত ছিল কিন্তু একটি %s-জাতিয় রাশি দেওয়া হয়েছে
    RT_STDSTR_INDEX_STR_NOT_STRING,
    // কথা.সূচক(ক, সূচক) কাজে দ্বিতীয় প্রেরণমান অর্থাৎ সূচক একটি সংখ্যা রাশি হওয়া উচিত ছিল কিন্তু একটি %s-জাতিয় রাশি দেওয়া হয়েছে
    RT_STDSTR_INDEX_INVALID_IDX_TYPE,
    // কথা.সূচক(ক, সূচক) কাজে দ্বিতীয় প্রেরণমান অর্থাৎ সূচক একটি ধনাত্মক পূর্ণসংখ্যা হওয়া উচিত ছিল কিন্তু %f দেওয়া হয়েছে
    RT_STDSTR_INDEX_INVALID_IDX_NUMTYPE,
    // কথা.সূচক(ক, সূচক) কাজের সূচকটি কথারাশিতে বর্তমান অক্ষরগুলির মোটসংখ্যার থেকে বড়, বৈধ সূচক হল ০ থেকে %llu
    RT_STDSTR_INDEX_INDEX_OUT_RANGE,
    // অভ্যন্তরীণ গোলমাল: কথা.সূচক(ক, সূচক) কাজে সূচকীয় অক্ষর খোঁজা বিফল হয়েছে
    RT_IME_STDSTR_INDEX_GRAPHEME_MEM,
    // অভ্যন্তরীণ গোলমাল: কথা.সূচক(ক, সূচক) কাজে ফেরত মান কথারাশি তৈরি বিফল হয়েছে
    RT_IME_STDSTR_INDEX_RESULT_STR,
    // অভ্যন্তরীণ গোলমাল: কথা.সূচক(ক, সূচক) কাজে সূচকীয় অক্ষর খোঁজা বিফল হয়েছে
    RT_IME_STDSTR_INDEX_UNREACHABLE,
    // কথা.ভাগ(ক, বিভাজক) কাজের প্রথম প্রেরণমান অর্থাৎ ক একটি কথারাশি হওয়া উচিত ছিল কিন্তু একটি %s-জাতিয় রাশি দেওয়া হয়েছে
    RT_STDSTR_SPLIT_STR_NOT_STRING,
    // কথা.ভাগ(ক, বিভাজক) কাজের দ্বিতীয় প্রেরণমান অর্থাৎ বিভাজক একটি কথারাশি হওয়া উচিত ছিল কিন্তু একটি %s-জাতিয় রাশি দেওয়া হয়েছে
    RT_STDSTR_SPLIT_DELIM_NOT_STRING,
    // অভ্যন্তরীণ গোলমাল: কথা.ভাগ(ক, বিভাজক) কাজে 'ক' কথারাশিকে ভাগ করা বিফল হয়েছে
    RT_IME_STDSTR_SPLIT_MEM,
    // অভ্যন্তরীণ গোলমাল: কথা.ভাগ(ক, বিভাজক) কাজে ফেরত মানের খণ্ডগুলি তৈরি বিফল হয়েছে
    RT_IME_STDSTR_SPLIT_TEMPSTR,
    // অভ্যন্তরীণ গোলমাল: কথা.ভাগ(ক, বিভাজক) কাজে ফেরত মানের তালিকা তৈরি বিফল হয়েছে
    RT_IME_STDSTR_SPLIT_RESULTARR,
    // অভ্যন্তরীণ গোলমাল: কথা.পরিবর্তন(মান) কাজে দেওয়া %s-জাতিয় প্রেরণমানকে কথারাশিতে পরিবর্তন বিফল হয়েছে
    RT_IME_STDSTR_STR_VALTOSTR,
    // অভ্যন্তরীণ গোলমাল: কথা.পরিবর্তন(মান) কাজে দেওয়া %s-জাতিয় প্রেরণমানকে কথারাশিতে পরিবর্তন করে ফেরত মান তৈরি বিফল হয়েছে
    RT_IME_STDSTR_STR_RESULT,
    // পট.নতুন(পর্দার_দৈর্ঘ্য, পর্দার_প্রস্থ, পর্দার_শিরোনাম) কাজের 'পর্দার_দৈর্ঘ্য' একটি সংখ্যা হওয়া উচিত ছিল কিন্তু একটি %s-জাতিয় রাশি পাওয়া গেছে
    RT_STDGFX_NEW_HEIGHT_INVALID_TYPE,
    // পট.নতুন(পর্দার_দৈর্ঘ্য, পর্দার_প্রস্থ, পর্দার_শিরোনাম) কাজের 'পর্দার_দৈর্ঘ্য' (%f) একটি বৈধ ব্যবহারযোগ্য সংখ্যা নয়, এটি সাধারণ পূর্ণসংখ্যার সীমা লঙ্ঘন করছে
    RT_STDGFX_NEW_HEIGHT_INVALID_INT_RANGE,
    // পট.নতুন(পর্দার_দৈর্ঘ্য, পর্দার_প্রস্থ, পর্দার_শিরোনাম) কাজের 'পর্দার_দৈর্ঘ্য' একটি ধনাত্মক পূর্ণসংখ্যা হওয়া উচিত ছিল কিন্তু %f পাওয়া গেলো
    RT_STDGFX_NEW_HEIGHT_NOT_POS_INT,
    // পট.নতুন(পর্দার_দৈর্ঘ্য, পর্দার_প্রস্থ, পর্দার_শিরোনাম) কাজের 'পর্দার_প্রস্থ' একটি সংখ্যা হওয়া উচিত ছিল কিন্তু একটি %s-জাতিয় রাশি পাওয়া গেছে
    RT_STDGFX_NEW_WIDTH_INVALID_TYPE,
    // পট.নতুন(পর্দার_দৈর্ঘ্য, পর্দার_প্রস্থ, পর্দার_শিরোনাম) কাজের 'পর্দার_প্রস্থ' (%f) একটি বৈধ ব্যবহারযোগ্য সংখ্যা নয়, এটি সাধারণ পূর্ণসংখ্যার সীমা লঙ্ঘন করছে
    RT_STDGFX_NEW_WIDTH_INVALID_INT_RANGE,
    // পট.নতুন(পর্দার_দৈর্ঘ্য, পর্দার_প্রস্থ, পর্দার_শিরোনাম) কাজের 'পর্দার_প্রস্থ' একটি ধনাত্মক পূর্ণসংখ্যা হওয়া উচিত ছিল কিন্তু %f পাওয়া গেলো
    RT_STDGFX_NEW_WIDTH_NOT_POS_INT,
    // পট.নতুন(পর্দার_দৈর্ঘ্য, পর্দার_প্রস্থ, পর্দার_শিরোনাম) কাজের 'পর্দার_শিরোনাম' একটি কথারাশি হওয়া উচিত ছিল কিন্তু একটি %s-জাতিয় রাশি পাওয়া গেছে
    RT_STDGFX_NEW_TITLE_INVALID_TYPE,
    // পট.রেখা(ক, খ, গ, ঘ, রঙ) কাজের 'ক' প্রেরণমান অর্থাৎ অনুভূমিক অক্ষের প্রথম অবস্থান একটি সংখ্যা হওয়া উচিত ছিল কিন্তু একটি %s-জাতিয় রাশি পাওয়া গেছে
    RT_STDGFX_LINE_X1_INVALID_TYPE,
    // পট.রেখা(ক, খ, গ, ঘ, রঙ) কাজের 'খ' প্রেরণমান অর্থাৎ উলম্ব অক্ষের প্রথম অবস্থান একটি সংখ্যা হওয়া উচিত ছিল কিন্তু একটি %s-জাতিয় রাশি পাওয়া গেছে
    RT_STDGFX_LINE_Y1_INVALID_TYPE,
    // পট.রেখা(ক, খ, গ, ঘ, রঙ) কাজের 'গ' প্রেরণমান অর্থাৎ অনুভূমিক অক্ষের দ্বিতীয় অবস্থান একটি সংখ্যা হওয়া উচিত ছিল কিন্তু একটি %s-জাতিয় রাশি পাওয়া গেছে
    RT_STDGFX_LINE_X2_INVALID_TYPE,
    // পট.রেখা(ক, খ, গ, ঘ, রঙ) কাজের 'ঘ' প্রেরণমান অর্থাৎ উলম্ব অক্ষের দ্বিতীয় অবস্থান একটি সংখ্যা হওয়া উচিত ছিল কিন্তু একটি %s-জাতিয় রাশি পাওয়া গেছে
    RT_STDGFX_LINE_Y2_INVALID_TYPE,
    // পট.রেখা(ক, খ, গ, ঘ, রঙ) কাজের 'রঙ' প্রেরণমান একটি কথারাশি হওয়া উচিত ছিল কিন্তু একটি %s-জাতিয় রাশি পাওয়া গেছে
    RT_STDGFX_LINE_COLOR_INVALID_TYPE,
    // পট.রেখা(ক, খ, গ, ঘ, রঙ) কাজের 'রঙ' প্রেরণমানে একটি অবৈধ রঙ '%s' দেওয়া হয়েছে
    RT_STDGFX_LINE_COLOR_INVALID_VALUE,
    // পট.বিন্দু(ক, খ, রঙ) কাজের 'ক' প্রেরণমান একটি সংখ্যা হওয়া উচিত ছিল কিন্তু একটি %s-জাতিয় রাশি পাওয়া গেছে
    RT_STDGFX_PIXEL_X_INVALID_TYPE,
    // পট.বিন্দু(ক, খ, রঙ) কাজের 'খ' প্রেরণমান একটি সংখ্যা হওয়া উচিত ছিল কিন্তু একটি %s-জাতিয় রাশি পাওয়া গেছে
    RT_STDGFX_PIXEL_Y_INVALID_TYPE,
    // পট.বিন্দু(ক, খ, রঙ) কাজের 'রঙ' প্রেরণমান একটি কথারাশি হওয়া উচিত ছিল কিন্তু একটি %s-জাতিয় রাশি পাওয়া গেছে
    RT_STDGFX_PIXEL_COLOR_INVALID_TYPE,
    // পট.বিন্দু(ক, খ, রঙ)  কাজের 'রঙ' প্রেরণমানে একটি অবৈধ রঙ '%s' দেওয়া হয়েছে
    RT_STDGFX_PIXEL_COLOR_INVALID_VALUE,
    // পট.আয়তক্ষেত্র(ক, খ, দৈর্ঘ্য, প্রস্থ, রঙ) কাজের 'ক' প্রেরণমান একটি সংখ্যা হওয়া উচিত ছিল কিন্তু একটি %s-জাতিয় রাশি পাওয়া গেছে
    RT_STDGFX_DRAWRECT_X_INVALID_TYPE,
    // পট.আয়তক্ষেত্র(ক, খ, দৈর্ঘ্য, প্রস্থ, রঙ) কাজের 'খ' প্রেরণমান একটি সংখ্যা হওয়া উচিত ছিল কিন্তু একটি %s-জাতিয় রাশি পাওয়া গেছে
    RT_STDGFX_DRAWRECT_Y_INVALID_TYPE,
    // পট.আয়তক্ষেত্র(ক, খ, দৈর্ঘ্য, প্রস্থ, রঙ) কাজের 'দৈর্ঘ্য' প্রেরণমান একটি সংখ্যা হওয়া উচিত ছিল কিন্তু একটি %s-জাতিয় রাশি পাওয়া গেছে
    RT_STDGFX_DRAWRECT_W_INVALID_TYPE,
    // পট.আয়তক্ষেত্র(ক, খ, দৈর্ঘ্য, প্রস্থ, রঙ) কাজের 'প্রস্থ' প্রেরণমান একটি সংখ্যা হওয়া উচিত ছিল কিন্তু একটি %s-জাতিয় রাশি পাওয়া গেছে
    RT_STDGFX_DRAWRECT_H_INVALID_TYPE,
    // পট.আয়তক্ষেত্র(ক, খ, দৈর্ঘ্য, প্রস্থ, রঙ) কাজের 'রঙ' প্রেরণমান একটি কথারাশি হওয়া উচিত ছিল কিন্তু একটি %s-জাতিয় রাশি পাওয়া গেছে
    RT_STDGFX_DRAWRECT_COLOR_INVALID_TYPE,
    // পট.আয়তক্ষেত্র(ক, খ, দৈর্ঘ্য, প্রস্থ, রঙ) কাজের 'রঙ' প্রেরণমানে একটি অবৈধ রঙ '%s' দেওয়া হয়েছে
    RT_STDGFX_DRAWRECT_COLOR_INVALID_VALUE,
    // পট.আয়তক্ষেত্র_রেখা(ক, খ, দৈর্ঘ্য, প্রস্থ, পুরুত্ব, রঙ) কাজের 'ক' প্রেরণমান একটি সংখ্যা হওয়া উচিত ছিল কিন্তু একটি %s-জাতিয় রাশি পাওয়া গেছে
    RT_STDGFX_DRAWRECTLINE_X_INVALID_TYPE,
    // পট.আয়তক্ষেত্র_রেখা(ক, খ, দৈর্ঘ্য, প্রস্থ, পুরুত্ব, রঙ) কাজের 'খ' প্রেরণমান একটি সংখ্যা হওয়া উচিত ছিল কিন্তু একটি %s-জাতিয় রাশি পাওয়া গেছে
    RT_STDGFX_DRAWRECTLINE_Y_INVALID_TYPE,
    // পট.আয়তক্ষেত্র_রেখা(ক, খ, দৈর্ঘ্য, প্রস্থ, পুরুত্ব, রঙ) কাজের 'দৈর্ঘ্য' প্রেরণমান একটি সংখ্যা হওয়া উচিত ছিল কিন্তু একটি %s-জাতিয় রাশি পাওয়া গেছে
    RT_STDGFX_DRAWRECTLINE_W_INVALID_TYPE,
    // পট.আয়তক্ষেত্র_রেখা(ক, খ, দৈর্ঘ্য, প্রস্থ, পুরুত্ব, রঙ) কাজের 'প্রস্থ' প্রেরণমান একটি সংখ্যা হওয়া উচিত ছিল কিন্তু একটি %s-জাতিয় রাশি পাওয়া গেছে
    RT_STDGFX_DRAWRECTLINE_H_INVALID_TYPE,
    // পট.আয়তক্ষেত্র_রেখা(ক, খ, দৈর্ঘ্য, প্রস্থ, পুরুত্ব, রঙ) কাজের 'পুরুত্ব' প্রেরণমান একটি সংখ্যা হওয়া উচিত ছিল কিন্তু একটি %s-জাতিয় রাশি পাওয়া গেছে
    RT_STDGFX_DRAWRECTLINE_THICK_INVALID_TYPE,
    // পট.আয়তক্ষেত্র_রেখা(ক, খ, দৈর্ঘ্য, প্রস্থ, পুরুত্ব, রঙ) কাজের 'রঙ' প্রেরণমান একটি কথারাশি হওয়া উচিত ছিল কিন্তু একটি %s-জাতিয় রাশি পাওয়া গেছে
    RT_STDGFX_DRAWRECTLINE_COLOR_INVALID_TYPE,
    // পট.আয়তক্ষেত্র_রেখা(ক, খ, দৈর্ঘ্য, প্রস্থ, পুরুত্ব, রঙ) কাজের 'রঙ' প্রেরণমানে একটি অবৈধ রঙ '%s' দেওয়া হয়েছে
    RT_STDGFX_DRAWRECTLINE_COLOR_INVALID_VALUE,
    // পট.বৃত্ত(ক, খ, ব্যাসার্ধ, রঙ) কাজের 'ক' প্রেরণমান একটি সংখ্যা হওয়া উচিত ছিল কিন্তু একটি %s-জাতিয় রাশি পাওয়া গেছে
    RT_STDGFX_CIRCLE_X_INVALID_TYPE,
    // পট.বৃত্ত(ক, খ, ব্যাসার্ধ, রঙ) কাজের 'খ' প্রেরণমান একটি সংখ্যা হওয়া উচিত ছিল কিন্তু একটি %s-জাতিয় রাশি পাওয়া গেছে
    RT_STDGFX_CIRCLE_Y_INVALID_TYPE,
    // পট.বৃত্ত(ক, খ, ব্যাসার্ধ, রঙ) কাজের 'ব্যাসার্ধ' প্রেরণমান একটি সংখ্যা হওয়া উচিত ছিল কিন্তু একটি %s-জাতিয় রাশি পাওয়া গেছে
    RT_STDGFX_CIRCLE_R_INVALID_TYPE,
    // পট.বৃত্ত(ক, খ, ব্যাসার্ধ, রঙ) কাজের 'রঙ' প্রেরণমান একটি কথারাশি হওয়া উচিত ছিল কিন্তু একটি %s-জাতিয় রাশি পাওয়া গেছে
    RT_STDGFX_CIRCLE_COLOR_INVALID_TYPE,
    // পট.বৃত্ত(ক, খ, ব্যাসার্ধ, রঙ) কাজের 'রঙ' প্রেরণমানে একটি অবৈধ রঙ '%s' দেওয়া হয়েছে
    RT_STDGFX_CIRCLE_COLOR_INVALID_VALUE,
    // পট.বৃত্ত_রেখা(ক, খ, ব্যাসার্ধ, পুরুত্ব, রঙ) কাজের 'ক' প্রেরণমান একটি সংখ্যা হওয়া উচিত ছিল কিন্তু একটি %s-জাতিয় রাশি পাওয়া গেছে
    RT_STDGFX_CIRCLELINE_X_INVALID_TYPE,
    // পট.বৃত্ত_রেখা(ক, খ, ব্যাসার্ধ, পুরুত্ব, রঙ) কাজের 'খ' প্রেরণমান একটি সংখ্যা হওয়া উচিত ছিল কিন্তু একটি %s-জাতিয় রাশি পাওয়া গেছে
    RT_STDGFX_CIRCLELINE_Y_INVALID_TYPE,
    // পট.বৃত্ত_রেখা(ক, খ, ব্যাসার্ধ, পুরুত্ব, রঙ) কাজের 'ব্যাসার্ধ' প্রেরণমান একটি সংখ্যা হওয়া উচিত ছিল কিন্তু একটি %s-জাতিয় রাশি পাওয়া গেছে
    RT_STDGFX_CIRCLELINE_R_INVALID_TYPE,
    // পট.বৃত্ত_রেখা(ক, খ, ব্যাসার্ধ, পুরুত্ব, রঙ) কাজের 'পুরুত্ব' প্রেরণমান একটি সংখ্যা হওয়া উচিত ছিল কিন্তু একটি %s-জাতিয় রাশি পাওয়া গেছে
    RT_STDGFX_CIRCLELINE_THICK_INVALID_TYPE,
    // পট.বৃত্ত_রেখা(ক, খ, ব্যাসার্ধ, পুরুত্ব, রঙ) কাজের 'রঙ' প্রেরণমান একটি কথারাশি হওয়া উচিত ছিল কিন্তু একটি %s-জাতিয় রাশি পাওয়া গেছে
    RT_STDGFX_CIRCLELINE_COLOR_INVALID_TYPE,
    // পট.বৃত্ত_রেখা(ক, খ, ব্যাসার্ধ, পুরুত্ব, রঙ) কাজের 'রঙ' প্রেরণমানে একটি অবৈধ রঙ '%s' দেওয়া হয়েছে
    RT_STDGFX_CIRCLELINE_COLOR_INVALID_VALUE,
    // পট.লেখা(ক, খ, কথা, আয়তন, রঙ) কাজের 'ক' প্রেরণমান একটি সংখ্যা হওয়া উচিত ছিল কিন্তু একটি %s-জাতিয় রাশি পাওয়া গেছে
    RT_STDGFX_TEXT_X_INVALID_TYPE,
    // পট.লেখা(ক, খ, কথা, আয়তন, রঙ) কাজের 'খ' প্রেরণমান একটি সংখ্যা হওয়া উচিত ছিল কিন্তু একটি %s-জাতিয় রাশি পাওয়া গেছে
    RT_STDGFX_TEXT_Y_INVALID_TYPE,
    // পট.লেখা(ক, খ, কথা, আয়তন, রঙ) কাজের 'কথা' প্রেরণমান একটি কথারাশি হওয়া উচিত ছিল কিন্তু একটি %s-জাতিয় রাশি পাওয়া গেছে
    RT_STDGFX_TEXT_TEXT_INVALID_TYPE,
    // পট.লেখা(ক, খ, কথা, আয়তন, রঙ) কাজের 'আয়তন' প্রেরণমান একটি সংখ্যা হওয়া উচিত ছিল কিন্তু একটি %s-জাতিয় রাশি পাওয়া গেছে
    RT_STDGFX_TEXT_SIZE_INVALID_TYPE,
    // পট.লেখা(ক, খ, কথা, আয়তন, রঙ) কাজের 'রঙ' প্রেরণমান একটি কথারাশি হওয়া উচিত ছিল কিন্তু একটি %s-জাতিয় রাশি পাওয়া গেছে
    RT_STDGFX_TEXT_COLOR_INVALID_TYPE,
    // পট.লেখা(ক, খ, কথা, আয়তন, রঙ) কাজের 'রঙ' প্রেরণমানে একটি অবৈধ রঙ '%s' দেওয়া হয়েছে
    RT_STDGFX_TEXT_COLOR_INVALID_VALUE,
    // পট.বোতাম_চাপা(বোতামের_নাম) কাজের 'বোতামের_নাম' প্রেরণমান একটি কথারাশি হওয়া উচিত ছিল কিন্তু একটি %s-জাতিয় রাশি পাওয়া গেছে
    RT_STDGFX_KEYPRESS_KEY_INVALID_TYPE,
    // পট.বোতাম_চাপা(বোতামের_নাম) কাজের 'বোতামের_নাম' প্রেরণমানে অবৈধ বোতামের নাম '%s' দেওয়া হয়েছে
    RT_STDGFX_KEYPRESS_KEY_INVALID_VALUE,
    // পট.বোতাম_চাপা_আছে(বোতামের_নাম) কাজের 'বোতামের_নাম' প্রেরণমান একটি কথারাশি হওয়া উচিত ছিল কিন্তু একটি %s-জাতিয় রাশি পাওয়া গেছে
    RT_STDGFX_KEYDOWN_KEY_INVALID_TYPE,
    // পট.বোতাম_চাপা_আছে(বোতামের_নাম) কাজের 'বোতামের_নাম' প্রেরণমানে অবৈধ বোতামের নাম '%s' দেওয়া হয়েছে
    RT_STDGFX_KEYDOWN_KEY_INVALID_VALUE,
    // পট.বোতাম_ছাড়া(বোতামের_নাম) কাজের 'বোতামের_নাম' প্রেরণমান একটি কথারাশি হওয়া উচিত ছিল কিন্তু একটি %s-জাতিয় রাশি পাওয়া গেছে
    RT_STDGFX_KEYUP_KEY_INVALID_TYPE,
    // পট.বোতাম_ছাড়া(বোতামের_নাম) কাজের 'বোতামের_নাম' প্রেরণমানে অবৈধ বোতামের নাম '%s' দেওয়া হয়েছে
    RT_STDGFX_KEYUP_KEY_INVALID_VALUE,
    // পট.বোতাম_ছাড়া_আছে(বোতামের_নাম) কাজের 'বোতামের_নাম' প্রেরণমান একটি কথারাশি হওয়া উচিত ছিল কিন্তু একটি %s-জাতিয় রাশি পাওয়া গেছে
    RT_STDGFX_KEYRELEASED_KEY_INVALID_TYPE,
    // পট.বোতাম_ছাড়া_আছে(বোতামের_নাম) কাজের 'বোতামের_নাম' প্রেরণমানে অবৈধ বোতামের নাম '%s' দেওয়া হয়েছে
    RT_STDGFX_KEYRELEASED_KEY_INVALID_VALUE,
    // পট.ছবি_আনয়ন(ছবির_পথ) কাজের 'ছবির_পথ' প্রেরণমান একটি কথারাশি হওয়া উচিত ছিল কিন্তু একটি %s-জাতিয় রাশি পাওয়া গেছে
    RT_STDGFX_LOADIMG_PATH_INVALID_TYPE,
    // পট.ছবি_আনয়ন(ছবির_পথ) কাজের 'ছবির_পথ' প্রেরণমানে দেওয়া ছবির পথে ('%s') কোনো নথি খুঁজে পাওয়া গেলো না
    RT_STDGFX_LOADIMG_FILE_NOT_FOUND,
    // অভ্যন্তরীণ গোলমাল: পট.ছবি_আনয়ন(ছবির_পথ) কাজের ছবিটি ব্যবহারের উপযোগী করে তোলা বিফল হয়েছে
    RT_IME_STDGFX_LOADIMG_FAILED_FETCH_IMAGE,
    // অভ্যন্তরীণ গোলমাল: পট.ছবি_আনয়ন(ছবির_পথ) কাজের ছবিটি ব্যবহারের উপযোগী করে তোলার জন্য ছবির জন্য বিশেষ অভ্যন্তরীণ নাম তৈরি বিফল হয়েছে
    RT_IME_STDGFX_LOADIMG_FAILED_IMAGE_STR,
    // পট.ছবি_আঁকো(ক, খ, ছবির_নাম) কাজের 'ক' প্রেরণমান একটি সংখ্যা হওয়া উচিত ছিল কিন্তু একটি %s-জাতিয় রাশি পাওয়া গেছে
    RT_STDGFX_DRAWIMG_X_INVALID_TYPE,
    // পট.ছবি_আঁকো(ক, খ, ছবির_নাম) কাজের 'খ' প্রেরণমান একটি সংখ্যা হওয়া উচিত ছিল কিন্তু একটি %s-জাতিয় রাশি পাওয়া গেছে
    RT_STDGFX_DRAWIMG_Y_INVALID_TYPE,
    // পট.ছবি_আঁকো(ক, খ, ছবির_নাম) কাজের 'ছবির_নাম' প্রেরণমান একটি কথারাশি হওয়া উচিত ছিল কিন্তু একটি %s-জাতিয় রাশি পাওয়া গেছে
    RT_STDGFX_DRAWIMG_IMG_INVALID_TYPE,
    // পট.ছবি_আঁকো(ক, খ, ছবির_নাম) কাজের 'ছবির_নাম' প্রেরণমানে একটি অবৈধ ছবির নাম দেওয়া হয়েছে
    RT_STDGFX_DRAWIMG_IMG_INVALID_VALUE,
    // অভ্যন্তরীণ গোলমাল: পট.ছবি_আঁকো(ক, খ, ছবির_নাম) কাজের 'ছবির_নাম' প্রেরণমানে দেওয়া ছবির নামের ছবিটি ব্যবহারের উপযোগী করা বিফল হয়েছে
    RT_IME_STDGFX_DRAWIMG_IMG_FETCH_FAIL,
    // পট.মাউস_চাপা(বোতামের_নাম) কাজের 'বোতামের_নাম' প্রেরণমান একটি কথারাশি হওয়া উচিত ছিল কিন্তু একটি %s-জাতিয় রাশি পাওয়া গেছে
    RT_STDGFX_MOUSEPRESSED_KEY_INVALID_TYPE,
    // পট.মাউস_চাপা(বোতামের_নাম) কাজের 'বোতামের_নাম' প্রেরণমানে অবৈধ মাউসের বোতামের নাম '%s' দেওয়া হয়েছে
    RT_STDGFX_MOUSEPRESSED_KEY_INVALID_VALUE,
    // পট.মাউস_চাপা_আছে(বোতামের_নাম) কাজের 'বোতামের_নাম' প্রেরণমান একটি কথারাশি হওয়া উচিত ছিল কিন্তু একটি %s-জাতিয় রাশি পাওয়া গেছে
    RT_STDGFX_MOUSEDOWN_KEY_INVALID_TYPE,
    // পট.মাউস_চাপা_আছে(বোতামের_নাম) কাজের 'বোতামের_নাম' প্রেরণমানে অবৈধ মাউসের বোতামের নাম '%s' দেওয়া হয়েছে
    RT_STDGFX_MOUSEDOWN_KEY_INVALID_VALUE,
    // পট.মাউস_ছাড়া(বোতামের_নাম) কাজের 'বোতামের_নাম' প্রেরণমান একটি কথারাশি হওয়া উচিত ছিল কিন্তু একটি %s-জাতিয় রাশি পাওয়া গেছে
    RT_STDGFX_MOUSERELEASED_KEY_INVALID_TYPE,
    // পট.মাউস_ছাড়া(বোতামের_নাম) কাজের 'বোতামের_নাম' প্রেরণমানে অবৈধ মাউসের বোতামের নাম '%s' দেওয়া হয়েছে
    RT_STDGFX_MOUSERELEASED_KEY_INVALID_VALUE,
    // পট.মাউস_ছাড়া_আছে(বোতামের_নাম) কাজের 'বোতামের_নাম' প্রেরণমান একটি কথারাশি হওয়া উচিত ছিল কিন্তু একটি %s-জাতিয় রাশি পাওয়া গেছে
    RT_STDGFX_MOUSEUP_KEY_INVALID_TYPE,
    // পট.মাউস_ছাড়া_আছে(বোতামের_নাম) কাজের 'বোতামের_নাম' প্রেরণমানে অবৈধ মাউসের বোতামের নাম '%s' দেওয়া হয়েছে
    RT_STDGFX_MOUSEUP_KEY_INVALID_VALUE,
    // পট.স্পর্শ_আয়তক্ষেত্র(১ম_আয়তক্ষেত্র_ক, ১ম_আয়তক্ষেত্র_খ, ১ম_আয়তক্ষেত্র_দৈর্ঘ্য, ১ম_আয়তক্ষেত্র_প্রস্থ, ২য়_আয়তক্ষেত্র_ক, ২য়_আয়তক্ষেত্র_খ, ২য়_আয়তক্ষেত্র_দৈর্ঘ্য, ২য়_আয়তক্ষেত্র_প্রস্থ) কাজের '১ম_আয়তক্ষেত্র_ক' প্রেরণমান একটি সংখ্যা হওয়া উচিত ছিল কিন্তু একটি %s-জাতিয় রাশি পাওয়া গেছে
    RT_STDGFX_2RECTCOLS_R1X_INVALID_TYPE,
    // পট.স্পর্শ_আয়তক্ষেত্র(১ম_আয়তক্ষেত্র_ক, ১ম_আয়তক্ষেত্র_খ, ১ম_আয়তক্ষেত্র_দৈর্ঘ্য, ১ম_আয়তক্ষেত্র_প্রস্থ, ২য়_আয়তক্ষেত্র_ক, ২য়_আয়তক্ষেত্র_খ, ২য়_আয়তক্ষেত্র_দৈর্ঘ্য, ২য়_আয়তক্ষেত্র_প্রস্থ) কাজের '১ম_আয়তক্ষেত্র_খ' প্রেরণমান একটি সংখ্যা হওয়া উচিত ছিল কিন্তু একটি %s-জাতিয় রাশি পাওয়া গেছে
    RT_STDGFX_2RECTCOLS_R1Y_INVALID_TYPE,
    // পট.স্পর্শ_আয়তক্ষেত্র(১ম_আয়তক্ষেত্র_ক, ১ম_আয়তক্ষেত্র_খ, ১ম_আয়তক্ষেত্র_দৈর্ঘ্য, ১ম_আয়তক্ষেত্র_প্রস্থ, ২য়_আয়তক্ষেত্র_ক, ২য়_আয়তক্ষেত্র_খ, ২য়_আয়তক্ষেত্র_দৈর্ঘ্য, ২য়_আয়তক্ষেত্র_প্রস্থ) কাজের '১ম_আয়তক্ষেত্র_দৈর্ঘ্য' প্রেরণমান একটি সংখ্যা হওয়া উচিত ছিল কিন্তু একটি %s-জাতিয় রাশি পাওয়া গেছে
    RT_STDGFX_2RECTCOLS_R1H_INVALID_TYPE,
    // পট.স্পর্শ_আয়তক্ষেত্র(১ম_আয়তক্ষেত্র_ক, ১ম_আয়তক্ষেত্র_খ, ১ম_আয়তক্ষেত্র_দৈর্ঘ্য, ১ম_আয়তক্ষেত্র_প্রস্থ, ২য়_আয়তক্ষেত্র_ক, ২য়_আয়তক্ষেত্র_খ, ২য়_আয়তক্ষেত্র_দৈর্ঘ্য, ২য়_আয়তক্ষেত্র_প্রস্থ) কাজের '১ম_আয়তক্ষেত্র_প্রস্থ' প্রেরণমান একটি সংখ্যা হওয়া উচিত ছিল কিন্তু একটি %s-জাতিয় রাশি পাওয়া গেছে
    RT_STDGFX_2RECTCOLS_R1W_INVALID_TYPE,
    // পট.স্পর্শ_আয়তক্ষেত্র(১ম_আয়তক্ষেত্র_ক, ১ম_আয়তক্ষেত্র_খ, ১ম_আয়তক্ষেত্র_দৈর্ঘ্য, ১ম_আয়তক্ষেত্র_প্রস্থ, ২য়_আয়তক্ষেত্র_ক, ২য়_আয়তক্ষেত্র_খ, ২য়_আয়তক্ষেত্র_দৈর্ঘ্য, ২য়_আয়তক্ষেত্র_প্রস্থ) কাজের '২য়_আয়তক্ষেত্র_ক' প্রেরণমান একটি সংখ্যা হওয়া উচিত ছিল কিন্তু একটি %s-জাতিয় রাশি পাওয়া গেছে
    RT_STDGFX_2RECTCOLS_R2X_INVALID_TYPE,
    // পট.স্পর্শ_আয়তক্ষেত্র(১ম_আয়তক্ষেত্র_ক, ১ম_আয়তক্ষেত্র_খ, ১ম_আয়তক্ষেত্র_দৈর্ঘ্য, ১ম_আয়তক্ষেত্র_প্রস্থ, ২য়_আয়তক্ষেত্র_ক, ২য়_আয়তক্ষেত্র_খ, ২য়_আয়তক্ষেত্র_দৈর্ঘ্য, ২য়_আয়তক্ষেত্র_প্রস্থ) কাজের '২য়_আয়তক্ষেত্র_খ' প্রেরণমান একটি সংখ্যা হওয়া উচিত ছিল কিন্তু একটি %s-জাতিয় রাশি পাওয়া গেছে
    RT_STDGFX_2RECTCOLS_R2Y_INVALID_TYPE,
    // পট.স্পর্শ_আয়তক্ষেত্র(১ম_আয়তক্ষেত্র_ক, ১ম_আয়তক্ষেত্র_খ, ১ম_আয়তক্ষেত্র_দৈর্ঘ্য, ১ম_আয়তক্ষেত্র_প্রস্থ, ২য়_আয়তক্ষেত্র_ক, ২য়_আয়তক্ষেত্র_খ, ২য়_আয়তক্ষেত্র_দৈর্ঘ্য, ২য়_আয়তক্ষেত্র_প্রস্থ) কাজের '২য়_আয়তক্ষেত্র_দৈর্ঘ্য' প্রেরণমান একটি সংখ্যা হওয়া উচিত ছিল কিন্তু একটি %s-জাতিয় রাশি পাওয়া গেছে
    RT_STDGFX_2RECTCOLS_R2H_INVALID_TYPE,
    // পট.স্পর্শ_আয়তক্ষেত্র(১ম_আয়তক্ষেত্র_ক, ১ম_আয়তক্ষেত্র_খ, ১ম_আয়তক্ষেত্র_দৈর্ঘ্য, ১ম_আয়তক্ষেত্র_প্রস্থ, ২য়_আয়তক্ষেত্র_ক, ২য়_আয়তক্ষেত্র_খ, ২য়_আয়তক্ষেত্র_দৈর্ঘ্য, ২য়_আয়তক্ষেত্র_প্রস্থ) কাজের '২য়_আয়তক্ষেত্র_প্রস্থ' প্রেরণমান একটি সংখ্যা হওয়া উচিত ছিল কিন্তু একটি %s-জাতিয় রাশি পাওয়া গেছে
    RT_STDGFX_2RECTCOLS_R2W_INVALID_TYPE,
    // পট.স্পর্শ_বিন্দু_আয়তক্ষেত্র(বিন্দু_ক, বিন্দু_খ, আয়তক্ষেত্র_ক, আয়তক্ষেত্র_খ, আয়তক্ষেত্র_দৈর্ঘ্য, আয়তক্ষেত্র_প্রস্থ) কাজের 'বিন্দু_ক' প্রেরণমান একটি সংখ্যা হওয়া উচিত ছিল কিন্তু একটি %s-জাতিয় রাশি পাওয়া গেছে
    RT_STDGFX_POINTRECTCOLS_PX_INVALID_TYPE,
    // পট.স্পর্শ_বিন্দু_আয়তক্ষেত্র(বিন্দু_ক, বিন্দু_খ, আয়তক্ষেত্র_ক, আয়তক্ষেত্র_খ, আয়তক্ষেত্র_দৈর্ঘ্য, আয়তক্ষেত্র_প্রস্থ) কাজের 'বিন্দু_খ' প্রেরণমান একটি সংখ্যা হওয়া উচিত ছিল কিন্তু একটি %s-জাতিয় রাশি পাওয়া গেছে
    RT_STDGFX_POINTRECTCOLS_PY_INVALID_TYPE,
    // পট.স্পর্শ_বিন্দু_আয়তক্ষেত্র(বিন্দু_ক, বিন্দু_খ, আয়তক্ষেত্র_ক, আয়তক্ষেত্র_খ, আয়তক্ষেত্র_দৈর্ঘ্য, আয়তক্ষেত্র_প্রস্থ) কাজের 'আয়তক্ষেত্র_ক' প্রেরণমান একটি সংখ্যা হওয়া উচিত ছিল কিন্তু একটি %s-জাতিয় রাশি পাওয়া গেছে
    RT_STDGFX_POINTRECTCOLS_RX_INVALID_TYPE,
    // পট.স্পর্শ_বিন্দু_আয়তক্ষেত্র(বিন্দু_ক, বিন্দু_খ, আয়তক্ষেত্র_ক, আয়তক্ষেত্র_খ, আয়তক্ষেত্র_দৈর্ঘ্য, আয়তক্ষেত্র_প্রস্থ) কাজের 'আয়তক্ষেত্র_খ' প্রেরণমান একটি সংখ্যা হওয়া উচিত ছিল কিন্তু একটি %s-জাতিয় রাশি পাওয়া গেছে
    RT_STDGFX_POINTRECTCOLS_RY_INVALID_TYPE,
    // পট.স্পর্শ_বিন্দু_আয়তক্ষেত্র(বিন্দু_ক, বিন্দু_খ, আয়তক্ষেত্র_ক, আয়তক্ষেত্র_খ, আয়তক্ষেত্র_দৈর্ঘ্য, আয়তক্ষেত্র_প্রস্থ) কাজের 'আয়তক্ষেত্র_দৈর্ঘ্য' প্রেরণমান একটি সংখ্যা হওয়া উচিত ছিল কিন্তু একটি %s-জাতিয় রাশি পাওয়া গেছে
    RT_STDGFX_POINTRECTCOLS_RH_INVALID_TYPE,
    // পট.স্পর্শ_বিন্দু_আয়তক্ষেত্র(বিন্দু_ক, বিন্দু_খ, আয়তক্ষেত্র_ক, আয়তক্ষেত্র_খ, আয়তক্ষেত্র_দৈর্ঘ্য, আয়তক্ষেত্র_প্রস্থ) কাজের 'আয়তক্ষেত্র_প্রস্থ' প্রেরণমান একটি সংখ্যা হওয়া উচিত ছিল কিন্তু একটি %s-জাতিয় রাশি পাওয়া গেছে
    RT_STDGFX_POINTRECTCOLS_RW_INVALID_TYPE,
    // পট.স্পর্শ_বৃত্ত_আয়তক্ষেত্র(বৃত্ত_ক, বৃত্ত_খ, বৃত্ত_ব্যসার্ধ, আয়তক্ষেত্র_ক, আয়তক্ষেত্র_খ, আয়তক্ষেত্র_দৈর্ঘ্য, আয়তক্ষেত্র_প্রস্থ) কাজের 'বৃত্ত_ক' প্রেরণমান একটি সংখ্যা হওয়া উচিত ছিল কিন্তু একটি %s-জাতিয় রাশি পাওয়া গেছে
    RT_STDGFX_CIRCLERECTCOLS_CX_INVALID_TYPE,
    // পট.স্পর্শ_বৃত্ত_আয়তক্ষেত্র(বৃত্ত_ক, বৃত্ত_খ, বৃত্ত_ব্যসার্ধ, আয়তক্ষেত্র_ক, আয়তক্ষেত্র_খ, আয়তক্ষেত্র_দৈর্ঘ্য, আয়তক্ষেত্র_প্রস্থ) কাজের 'বৃত্ত_খ' প্রেরণমান একটি সংখ্যা হওয়া উচিত ছিল কিন্তু একটি %s-জাতিয় রাশি পাওয়া গেছে
    RT_STDGFX_CIRCLERECTCOLS_CY_INVALID_TYPE,
    // পট.স্পর্শ_বৃত্ত_আয়তক্ষেত্র(বৃত্ত_ক, বৃত্ত_খ, বৃত্ত_ব্যসার্ধ, আয়তক্ষেত্র_ক, আয়তক্ষেত্র_খ, আয়তক্ষেত্র_দৈর্ঘ্য, আয়তক্ষেত্র_প্রস্থ) কাজের 'বৃত্ত_ব্যসার্ধ' প্রেরণমান একটি সংখ্যা হওয়া উচিত ছিল কিন্তু একটি %s-জাতিয় রাশি পাওয়া গেছে
    RT_STDGFX_CIRCLERECTCOLS_CR_INVALID_TYPE,
    // পট.স্পর্শ_বৃত্ত_আয়তক্ষেত্র(বৃত্ত_ক, বৃত্ত_খ, বৃত্ত_ব্যসার্ধ, আয়তক্ষেত্র_ক, আয়তক্ষেত্র_খ, আয়তক্ষেত্র_দৈর্ঘ্য, আয়তক্ষেত্র_প্রস্থ) কাজের 'আয়তক্ষেত্র_ক'প্রেরণমান  একটি সংখ্যা হওয়া উচিত ছিল কিন্তু একটি %s-জাতিয় রাশি পাওয়া গেছে
    RT_STDGFX_CIRCLERECTCOLS_RX_INVALID_TYPE,
    // পট.স্পর্শ_বৃত্ত_আয়তক্ষেত্র(বৃত্ত_ক, বৃত্ত_খ, বৃত্ত_ব্যসার্ধ, আয়তক্ষেত্র_ক, আয়তক্ষেত্র_খ, আয়তক্ষেত্র_দৈর্ঘ্য, আয়তক্ষেত্র_প্রস্থ) কাজের 'আয়তক্ষেত্র_খ' প্রেরণমান একটি সংখ্যা হওয়া উচিত ছিল কিন্তু একটি %s-জাতিয় রাশি পাওয়া গেছে
    RT_STDGFX_CIRCLERECTCOLS_RY_INVALID_TYPE,
    // পট.স্পর্শ_বৃত্ত_আয়তক্ষেত্র(বৃত্ত_ক, বৃত্ত_খ, বৃত্ত_ব্যসার্ধ, আয়তক্ষেত্র_ক, আয়তক্ষেত্র_খ, আয়তক্ষেত্র_দৈর্ঘ্য, আয়তক্ষেত্র_প্রস্থ) কাজের 'আয়তক্ষেত্র_দৈর্ঘ্য' প্রেরণমান একটি সংখ্যা হওয়া উচিত ছিল কিন্তু একটি %s-জাতিয় রাশি পাওয়া গেছে
    RT_STDGFX_CIRCLERECTCOLS_RH_INVALID_TYPE,
    // পট.স্পর্শ_বৃত্ত_আয়তক্ষেত্র(বৃত্ত_ক, বৃত্ত_খ, বৃত্ত_ব্যসার্ধ, আয়তক্ষেত্র_ক, আয়তক্ষেত্র_খ, আয়তক্ষেত্র_দৈর্ঘ্য, আয়তক্ষেত্র_প্রস্থ) কাজের 'আয়তক্ষেত্র_প্রস্থ' প্রেরণমান একটি সংখ্যা হওয়া উচিত ছিল কিন্তু একটি %s-জাতিয় রাশি পাওয়া গেছে
    RT_STDGFX_CIRCLERECTCOLS_RW_INVALID_TYPE,

	PANDIAG_CODE_COUNT
}PanDiagCode;

typedef struct PanDiagInfo{
	PanDiagCode code;
	PanDiagCat category;
	PanDiagSeverity severity;
	bool formatted;
	bool hinted;
	const char * msg;
	const char * hint;
}PanDiagInfo;

const PanDiagInfo * DiagGetInfo(PanDiagCode code);
const char * DiagGetMsg(PanDiagCode code);
const char * DiagGetHint(PanDiagCode code);


#ifdef __cplusplus
}
#endif

#endif
